# Apply function

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                    'Emp_Name':['Rajesh','Shankar','Sindhu','Akshay','Vivan','Monika','Salman','Aisha','Remo','Amitabh'],
                    'Salary': [4944,5455,6166,4044,3433,2922,6466,7977,6766,5155]})
df

   Dept Emp_Name  Salary
0     1   Rajesh    4944
1     2  Shankar    5455
2     3   Sindhu    6166
3     4   Akshay    4044
4     5    Vivan    3433
5     6   Monika    2922
6     7   Salman    6466
7     8    Aisha    7977
8     9     Remo    6766
9    10  Amitabh    5155

In [3]:
#define a function
def salary_hike(x):
    if(x>3000):
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x*1.5)

In [4]:
df['New_Salary'] = df['Salary'].apply(salary_hike)
print(df)

   Dept Emp_Name  Salary  New_Salary
0     1   Rajesh    4944      6428.0
1     2  Shankar    5455      7092.0
2     3   Sindhu    6166      8016.0
3     4   Akshay    4044      5258.0
4     5    Vivan    3433      4463.0
5     6   Monika    2922      4383.0
6     7   Salman    6466      8406.0
7     8    Aisha    7977     10371.0
8     9     Remo    6766      8796.0
9    10  Amitabh    5155      6702.0

In [5]:
#increased salary
df['Increased_Salary'] = df['New_Salary'] - df['Salary']
df

   Dept Emp_Name  Salary  New_Salary  Increased_Salary
0     1   Rajesh    4944      6428.0            1484.0
1     2  Shankar    5455      7092.0            1637.0
2     3   Sindhu    6166      8016.0            1850.0
3     4   Akshay    4044      5258.0            1214.0
4     5    Vivan    3433      4463.0            1030.0
5     6   Monika    2922      4383.0            1461.0
6     7   Salman    6466      8406.0            1940.0
7     8    Aisha    7977     10371.0            2394.0
8     9     Remo    6766      8796.0            2030.0
9    10  Amitabh    5155      6702.0            1547.0

In [6]:
a=df['New_Salary'].sum()
a

69915.0

In [7]:
##min and max
a = df['New_Salary'].min(),df['New_Salary'].max()
a

(4383.0, 10371.0)

In [8]:
##min and max
a = df['New_Salary'].min(),df['New_Salary'].max()
a

(4383.0, 10371.0)

In [9]:
print("\nName of columns\n",'-'*20)
print(df.columns)

Name of columns
 --------------------
Index(['Dept', 'Emp_Name', 'Salary', 'New_Salary', 'Increased_Salary'], dtype='object')

In [10]:
l = list(df.columns)
print("\nColumns name in a list of strings for later manipulation:\n ",l)

Columns name in a list of strings for later manipulation:
  ['Dept', 'Emp_Name', 'Salary', 'New_Salary', 'Increased_Salary']

In [11]:
print("\nDeleting column\n" ,'-'*50)
del df['Salary']
df

Deleting column
 --------------------------------------------------

   Dept Emp_Name  New_Salary  Increased_Salary
0     1   Rajesh      6428.0            1484.0
1     2  Shankar      7092.0            1637.0
2     3   Sindhu      8016.0            1850.0
3     4   Akshay      5258.0            1214.0
4     5    Vivan      4463.0            1030.0
5     6   Monika      4383.0            1461.0
6     7   Salman      8406.0            1940.0
7     8    Aisha     10371.0            2394.0
8     9     Remo      8796.0            2030.0
9    10  Amitabh      6702.0            1547.0

In [15]:
df.sort_values(by='New_Salary',ascending=False) #ascending=True by default

   Dept Emp_Name  New_Salary  Increased_Salary
7     8    Aisha     10371.0            2394.0
8     9     Remo      8796.0            2030.0
6     7   Salman      8406.0            1940.0
2     3   Sindhu      8016.0            1850.0
1     2  Shankar      7092.0            1637.0
9    10  Amitabh      6702.0            1547.0
0     1   Rajesh      6428.0            1484.0
3     4   Akshay      5258.0            1214.0
4     5    Vivan      4463.0            1030.0
5     6   Monika      4383.0            1461.0